{"context":{"info":{"email":"workemam54637@gmail.com","imgUrl":"http://res.cloudinary.com/diovjjf4c/image/upload/v1687353507/64926c62fe1fedb368c7c796/CEw1dzMADg8UfTTmLxI4dCecUkvLeAqDH5TnadG8IU.png","address":"Qism Kafr El-Shaikh , Kafr El-Shaikh, Egypt","city":" Kafr El-Shaikh","country":"Egypt","firstName":"Mahmoud","jobTitle":"Full stack Developer ","lastName":"Imam","nationality":"Egyption","phone":"01091907365","placeOfBirth":"","postalCode":"33511","availability":"full_time"},"websites":[{"label":"linkedin","link":"https://www.linkedin.com/in/mahmoudimamashour/"},{"label":"github","link":"https://github.com/Emam546"},{"label":"resume","link":"https://drive.google.com/file/d/1Nm73z7CcDL7_4zTSjG6qZcG64M2iH9Wx/view?usp=drive_link"}]},"__N_SSG":true,"pageProps":{"projects":[{"color":"#f37737","id":0,"image":"/projectsImages/STbHgIFcJvsMBkJgT5GKUljewqLvFBMMm5xE6XTHHQ=.png","description":"<p>Developed a Disney clone website using Next.js, a popular React framework known for its server-side rendering capabilities, ensuring fast loading times and optimal performance.</p>\n<ul>\n<li>Implemented server‑side rendering for fast loading times and optimal performance.</li>\n<li>Designed a responsive user interface resembling the Disney website.</li>\n<li>Utilized Next.js routing for seamless navigation.</li>\n<li>Implemented search functionality for easy content discovery.</li>\n<li>Ensured responsive design for different devices and screen sizes&nbsp;</li>\n</ul>\n","technologies":"Next.js | TypeScript | Express.js","title":"Disney plus films","deployed":"https://disney-olj2.onrender.com/","github":"https://github.com/Emam546/disney_plus_films"},{"color":"#29cbe0","id":1,"image":"/projectsImages/XM7K3Jb9CLHXphVz2Ma3JoABCW6wmKI86CxK0aEqk.png","description":"<p>Developed a Y2Mate clone website that allows users to download and convert online videos from popular platforms like YouTube, Vimeo, and others.</p>\n<ul>\n<li>Enabled users to download and convert online videos from platforms like YouTube and Vimeo.</li>\n<li>Designed a user-friendly interface for users to paste video URLs and select desired formats.</li>\n<li>Integrated APIs to fetch video metadata and handle the download and conversion processes.</li>\n<li>Implemented advanced features such as thumbnail generation, progress tracking, and error handling.</li>\n<li>Ensured responsive design for optimal user experience on different devices.</li>\n<li>Collaborated with a team using Git for version control and efficient project management.&nbsp;</li>\n</ul>\n","technologies":"Next.js | Express.js | TypeScript","title":"Youtube Downloader","deployed":"https://youtube-playlists.onrender.com/","github":"https://github.com/Emam546/youtube-playlist-server"},{"color":"#6c4bf4","id":2,"image":"/projectsImages/YtlDsOGJn8OngUnlCKK7Z619rsfRdO3LIBhdJqD84.png","description":"<p>Resume-API Builder is a web application that simplifies the process of generating APIs for resumes. It allows users to enter their resume details and personal information, which are used to create a custom API for their resume.</p>\n<ul>\n<li>User-Friendly Interface: The application provides an intuitive interface for users to input their resume details and personal information easily.</li>\n<li>Custom API Generation: Resume-API Builder dynamically generates a custom API based on the entered information, serving as a digital representation of the user's resume.</li>\n<li>Integration Support: The generated API can be easily integrated into other applications or websites, enabling users to showcase their resumes programmatically.</li>\n<li>Technology Stack: The application is built using Next.js, TypeScript, Tailwind CSS, Express, and MongoDB, ensuring a robust and efficient development process.</li>\n</ul>\n","technologies":"Next.js | Express.js | Tailwind CSS","title":"Cv Api Builder","deployed":"https://cv-builder-tobe.onrender.com/","github":"https://github.com/Emam546/cv-builder"},{"color":"#f85781","id":3,"image":"/projectsImages/7x1fUMbQnTGBcszBAPQ7l4STmOyUh0i4HWDxhZ2tk.png","description":"<p>Radalata is an innovative web application that enables anonymous messaging worldwide. Users can send and receive weird messages from anonymous individuals, fostering a sense of intrigue and open communication.</p>\n<ul>\n<li>Anonymous Messaging: Send and receive weird messages without revealing your identity, ensuring privacy and encouraging uninhibited conversations.</li>\n<li>Global Reach: Connect with people from around the world, facilitating diverse and multicultural exchanges of ideas and experiences.</li>\n<li>Real-Time Communication: Utilizes Socket.io, Next.js, TypeScript, and Express to enable real-time messaging for an interactive user experience.</li>\n<li>User-Friendly Interface: Easy-to-use interface for seamless navigation and quick message submission.</li>\n<li>Engaging Community: Build a vibrant community of users who enjoy sharing and responding to weird messages.</li>\n</ul>\n","technologies":"Next.js | TypeScript | Socket.io","title":"Radalata","deployed":"https://radalata.onrender.com","github":"https://github.com/Emam546/RadaLata"},{"color":"#ffcc33","id":4,"image":"/projectsImages/7naWlxUUEGkrEcOrInf5Qvj80vzo2r6BJcxbpNHVEQ.png","description":"<p>The IP Address Tracker is a web application developed using Express.js and Tailwind CSS. It provides users with a convenient way to track and obtain information about IP addresses. By entering an IP address, users can retrieve details such as location, ISP, and other relevant data.</p>\n<ul>\n<li>IP Address Tracking: The application allows users to enter an IP address and retrieve information about its location, ISP, and other relevant details.</li>\n<li>Express.js Backend: The backend of the application is built using Express.js, a fast and minimalist web application framework for Node.js. It enables efficient handling of requests and data processing.</li>\n<li>Tailwind CSS Styling: The user interface is designed using Tailwind CSS, a utility-first CSS framework. It offers a responsive and visually appealing design for a seamless user experience.</li>\n<li>Geolocation Data: The application leverages geolocation data APIs to fetch and display accurate information about the IP address location.</li>\n<li>User-Friendly Interface: The interface is intuitive and user-friendly, making it easy for users to input an IP address and view the corresponding information.&nbsp;</li>\n</ul>\n","technologies":"Express.js | Tailwind CSS | React","title":"Ip address tracker","deployed":"https://emam546.github.io/ip-address-tracker/","github":"https://github.com/Emam546/ip-address-tracker"},{"color":"#3e67ff","id":5,"image":"/projectsImages/jjTqKDWpce0M6rjWk9itVjTtL3NVEIckPJciCShzM.png","description":"<p>The Space Tourism App is a web application designed to showcase space tourism destinations. It utilizes React and Tailwind CSS to create an interactive and visually appealing user experience.</p>\n<ul>\n<li>Destination Showcase: The app presents various space tourism destinations, providing information and captivating visuals to engage users.</li>\n<li>Responsive Design: The app is built to be responsive, ensuring a seamless experience across different devices and screen sizes.</li>\n<li>Interactive Elements: Users can interact with different elements of the app, such as viewing details of specific destinations and exploring available packages.</li>\n<li>Visual Appeal: Tailwind CSS is used to enhance the app's aesthetics, creating visually appealing layouts, typography, and color schemes.</li>\n</ul>\n","technologies":"React | Tailwind CSS | React Router","title":"Space tourism","deployed":"https://emam546.github.io/space-tourism-template/","github":"https://github.com/Emam546/space-tourism-template"}],"sideProjects":[{"color":"#f37737","id":0,"image":"/projectsImages/Dah7IVNKn0d5TvEbxRlpC4RQ2Se9Aef5wAd0MCS5g0.png","description":"<p>The Multi-Step Form is a single-page application developed using React, Tailwind CSS, and React Router. It simplifies the form-filling process by breaking it down into multiple steps, providing users with a seamless and guided experience&nbsp;</p>\n","technologies":"React | Tailwind CSS","title":"Multi step form","deployed":"https://emam546.github.io/MultiStepForm/","github":"https://github.com/Emam546/MultiStepForm"},{"color":"#29cbe0","id":1,"image":"/projectsImages/m4ecT8ygUnVPCi7J3BEApvvSxgM7zKdg2i6QVcQ84.png","description":"<p>Single Page is a website built using Bootstrap and Sass. It serves as a concise and informative online presence for a company, providing essential details and showcasing its products or services on a single page.&nbsp;</p>\n","technologies":"Bootstrap | Sass","title":"Company page","deployed":"https://emam546.github.io/portfolio-sass-bootstrap/","github":"https://github.com/Emam546/portfolio-sass-bootstrap"},{"color":"#6c4bf4","id":2,"image":"/projectsImages/w6mwq99OqSpQcguJK0XlEzroWRhqoQ2THZLnr81pdlE.png","description":"<p>The Interactive Comment Section is a dynamic and engaging feature that allows users to interact and share their thoughts on a platform.&nbsp;</p>\n","technologies":"React | Tailwind CSS","title":"Interactive comments section","deployed":"https://emam546.github.io/interactive-comments-section/","github":"https://github.com/Emam546/interactive-comments-section"}]}}